<?php
// +----------------------------------------------------------------------
// | 登录相关函数
// +----------------------------------------------------------------------
// | Author: stormhu E:stormgu@foxmail.com
// +----------------------------------------------------------------------
namespace app\website\library;
use think\Session;

class Login
{
	// +----------------------------------------------------------------------
	// | 登录(ok)
	// +----------------------------------------------------------------------
	// | @Author: stormhu E:stormgu@foxmail.com
	// +----------------------------------------------------------------------
	public function login($name,$pass){
		// 通过用户名获取用户加密密码
		// 通过$pass获取计算后的密码
		// 核对两个密码返回结果
		// 成功保存状态
		$user = db("user")->where("name",$name)->find();
		$temp_pass = $this->makepass($pass, $user['salt']);
		if($temp_pass===$user['pass']){
			Session::set("name",$name);
			Session::set("sign",md5($temp_pass));
			return true;
		}else{
			return false;
		}
	}


	// +----------------------------------------------------------------------
	// | 登出
	// +----------------------------------------------------------------------
	// | @Author: stormhu E:stormgu@foxmail.com
	// +----------------------------------------------------------------------
	public function logout(){
		Session::delete("name");
		Session::delete("sign");
	}

	// +----------------------------------------------------------------------
	// | 密码验证函数()
	// +----------------------------------------------------------------------
	// | 加密方式：MD5(MD5(pass)+slot);
	// +----------------------------------------------------------------------
	// | @Author: stormhu E:stormgu@foxmail.com
	// +----------------------------------------------------------------------
	public function makepass($pass,$salt){
		$pass = md5(md5($pass).$salt);
		return $pass;
	}
}